БИТУправление_медицинским_центром_демо/src/DataProcessors/бит_сл_КлиентЛицензирования/бит_сл_КлиентЛицензирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>бит_сл_КлиентЛицензирования</name>
  <attributes>
    <name>АдресСервераИПорт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортАссистентаСервераЛицензий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UDPПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОжиданияДоАктивации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяНадпись</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеАктивации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСоединения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияКлиента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияСервера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияКлиентаИСервера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФильтроватьСписок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоПовторов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>общ_UDPПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьProxyСервер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияДляТехПоддержки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МожетТребоватьсяИзменениеВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлиентСоздан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>общ_СписокИсключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>общ_АдресСервераИПорт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>общ_ПортАссистентаСервераЛицензий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>общ_ВремяОжиданияДоАктивации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>общ_ПубликацияНастроек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>общ_ИспользоватьProxyСервер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСерверов</name>
    <attributes>
      <name>IPАдрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>TCPПорт</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Совместимость</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьЛицензия</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Загруженность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияСервера</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокПользователей</name>
    <attributes>
      <name>Исключить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПользовательИБ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

БИТУправление_медицинским_центром_демо/src/DataProcessors/бит_сл_КлиентЛицензирования/Forms/СписокПользователей_упр_8_2_13/Module.bsl
// ЛОКАЛЬНЫЕ ПЕРЕМЕННЫЕ  ///////////////////////////////////////////////////////////////////////////////////////////

// СЕРВЕРНЫЕ МЕТОДЫ  ///////////////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЛокализироватьИнтерфейс();
	
КонецПроцедуры


&НаСервере
// Загружает во все элементы формы локализированные данные
//
Процедура ЛокализироватьИнтерфейс();

	ЛокализацияСоответствие = бит_сл_общий.ПолучитьДанныеЛокализации();
	        
	Для Каждого ЭлементЗн Из ЛокализацияСоответствие Цикл
		
		Если Лев(ЭлементЗн.Ключ, 49) = "сл_КлиентЛицензирования_Интерфейс_Пользователи_16" Тогда
			
			Попытка
				
				СтрокаКомандыЛокализации = Прав(ЭлементЗн.Ключ, СтрДлина(ЭлементЗн.Ключ) - 50);
				СтрокаКомандыЛокализации = СтрЗаменить(СтрокаКомандыЛокализации, "_", ".") + " = """ + ЭлементЗн.Значение + """";
				
				Выполнить(СтрокаКомандыЛокализации);
				
			Исключение
				
				ПараметрыСообщения = Новый Соответствие;
				ПараметрыСообщения.Вставить("##1##", ЭлементЗн.Ключ);
				Сообщить( бит_сл_общий.ПолучитьСтрокуСообщения("сл_КлиентЛицензирования_ЛокализацияСодержитОшибки", ПараметрыСообщения) );							
				
			КонецПопытки;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

// ОБРАБОТЧИКИ ОЖИДАНИЯ ////////////////////////////////////////////////////////////////////////////////////////////

// КЛИЕНТСКИЕ МЕТОДЫ ///////////////////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
// Для всех строк устанавливает флажки в заданное значение
//
Процедура УстановитьФлажки(Значение)

	Для Каждого СтрокаСписка Из Объект.СписокПользователей Цикл
	
		СтрокаСписка.Исключить = Значение;	
	
	КонецЦикла; 	

КонецПроцедуры // УстановитьФлажки() 

&НаКлиенте
// Определяет, находится ли пользователь в списке исключения
//
Функция ПользовательЕстьВСпискеИсключения(ИДПользователя)

	Возврат Найти(ЭтаФорма.ВладелецФормы.Объект.общ_СписокИсключения, ИДПользователя) > 0;	

КонецФункции // ПользовательЕстьВСпискеИсключения() 

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Объект.СписокПользователей.Очистить();
	
	// Получим список пользователей ИБ
	ТекущиеПользователиИБ = Новый Массив;
	Результат = бит_сл_сервер.ПолучитьСписокПользователей(ТекущиеПользователиИБ);
	
	Если Не Результат Тогда
	
		бит_сл_общий.ВывестиСообщение( бит_сл_общий.ПолучитьСтрокуСообщения("сл_сервер_НедостаточноПравДляСпискаПользователей") );
		Отказ = Истина;
	
	КонецЕсли; 
	
	Если Не Отказ Тогда
		
		// Заполним таблицу списка пользователей
		Для Каждого ПользовательИБ Из ТекущиеПользователиИБ Цикл
			
			Строка = Объект.СписокПользователей.Добавить();
			Строка.ПользовательИБ = ПользовательИБ.ПолноеИмя;
			Строка.Идентификатор = ПользовательИБ.УникальныйИдентификатор;
			Строка.Исключить = ПользовательЕстьВСпискеИсключения(ПользовательИБ.УникальныйИдентификатор);
			
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеСтроки(Команда)

	УстановитьФлажки(Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеСтроки(Команда)

	УстановитьФлажки(Ложь);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)

	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)

	// Сформируем список исключения на основе таблицы списка пользователей и запишем его
	СтрокаСРазделителями = "";
	Для Каждого СтрокаСписка Из Объект.СписокПользователей Цикл
	
		Если СтрокаСписка.Исключить Тогда
			
			СтрокаСРазделителями = СтрокаСРазделителями + СтрокаСписка.Идентификатор + Символы.ПС;
			
		КонецЕсли;
	
	КонецЦикла;
	
	// Сохраняем в объект владельца новое значение 
	// (у этой формы объект является новым экземпляром обработки и не содержит связи с данными)
	ЭтаФорма.ВладелецФормы.Объект.общ_СписокИсключения = СтрокаСРазделителями;
	
	ЭтаФорма.Закрыть(Истина);	
	
КонецПроцедуры

// ИНИЦИАЛИЗАЦИЯ ЛОКАЛЬНЫХ ПЕРЕМЕННЫХ //////////////////////////////////////////////////////////////////////////////
